[M_IrisHUB_GasGuzzlers MissionDefinition]
MissionName="Tripas Para Consumo"
MissionDescription="Sir Hammerlock foi informado da presença de um grupo de Rakks mutantes em [place]Southern Raceway[-place].  Ele pediu para que você encontre-os para serem estudados."
TurnInDescription="Você entregou os sacos de óleo e causou um leve desconforto a um dos seus amigos em Santuário!"
MissionSummary="Elimine os Rakks e recolha os sacos de óleo que eles soltarem."
MissionGiver="Painel de Trabalhos da Cratera"
MissionTurnInLocation="Sir Hammerlock ou Scooter"
TeaserText="Cuidado com os Rakks flamejantes!"

[M_IrisHUB_GasGuzzlers:CollectSacks MissionObjectiveDefinition]
ProgressMessage="Recolha os sacos de óleo"

[M_IrisHUB_GasGuzzlers:KillRakks MissionObjectiveDefinition]
ProgressMessage="Elimine os Rakks gaseificados"

[M_IrisHUB_GasGuzzlers:MissionObjectiveSetBranchingDefinition_0 MissionObjectiveSetBranchingDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="Sir Hammerlock foi informado da presença de um grupo de Rakks mutantes em [place]Southern Raceway[-place].  Ele pediu para que você encontre-os para serem estudados.\n\nVocê já tem sacos de óleo suficientes, porém, agora você deve tomar uma decisão: entregar ao Scooter ou ao Hammerlock?"

[M_IrisHUB_GasGuzzlers:MissionObjectiveSetDefinition_7 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisHUB_GasGuzzlers:MissionObjectiveSetDefinition_8 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="Sir Hammerlock foi informado da presença de um grupo de Rakks mutantes em [place]Southern Raceway[-place].  Ele pediu para que você encontre-os para serem estudados.\n\nVocê encontrou os Rakks e descobriu que, ao matá-los eles soltam umas tripas cheias de óleo. Hammerlock pede que você as recolhas. Por outro lado, o Scooter duvida que o Hammerlock queira apenas estudá-los sem segundas intenções."

[M_IrisHUB_GasGuzzlers:TurnInHammerlock MissionObjectiveDefinition]
ProgressMessage="Entregue ao Hammerlock"

[M_IrisHUB_GasGuzzlers:TurnInScooter MissionObjectiveDefinition]
ProgressMessage="Entregue ao Scooter"

